{"dependencies":[{"name":"@fortawesome/fontawesome-free","version":"5.15.4","repository":"https://github.com/FortAwesome/Font-Awesome","copyright":"","licenses":"(CC-BY-4.0 AND OFL-1.1 AND MIT)","licenseId":0},{"name":"angular-sanitize","version":"1.8.2","repository":"https://github.com/angular/angular.js","copyright":"Copyright (c) 2016 Angular","licenses":"MIT","licenseId":1},{"name":"angular","version":"1.8.2","repository":"https://github.com/angular/angular.js","copyright":"Copyright (c) 2016 Angular","licenses":"MIT","licenseId":1},{"name":"bootstrap","version":"4.6.1","repository":"https://github.com/twbs/bootstrap","copyright":"Copyright (c) 2011-2021 Twitter, Inc.. Copyright (c) 2011-2021 The Bootstrap Authors","licenses":"MIT","licenseId":1},{"name":"code-prettify","version":"0.1.0","repository":"https://github.com/google/code-prettify","copyright":"","licenses":"Apache-2.0","licenseId":2},{"name":"datatables.net-dt","version":"1.11.3","repository":"https://github.com/DataTables/Dist-DataTables-DataTables","copyright":"Copyright SpryMedia Limited and other contributors. http://datatables.net","licenses":"MIT","licenseId":1},{"name":"datatables.net","version":"1.11.3","repository":"https://github.com/DataTables/Dist-DataTables","copyright":"Copyright SpryMedia Limited and other contributors. http://datatables.net","licenses":"MIT","licenseId":1},{"name":"jquery-ui-dist","version":"1.12.1","repository":"https://github.com/jquery/jquery-ui","copyright":"Copyright jQuery Foundation and other contributors, https://jquery.org/","licenses":"MIT","licenseId":3},{"name":"jquery","version":"3.6.0","repository":"https://github.com/jquery/jquery","copyright":"Copyright OpenJS Foundation and other contributors, https://openjsf.org/","licenses":"MIT","licenseId":1},{"name":"pako","version":"2.0.4","repository":"https://github.com/nodeca/pako","copyright":"Copyright (C) 2014-2017 by Vitaly Puzrin and Andrei Tuputcyn","licenses":"(MIT AND Zlib)","licenseId":1},{"name":"popper.js","version":"1.16.1","repository":"https://github.com/FezVrasta/popper.js","copyright":"","licenses":"MIT","licenseId":4}],"licenses":["Font Awesome Free License\n-------------------------\n\nFont Awesome Free is free, open source, and GPL friendly. You can use it for\ncommercial projects, open source projects, or really almost whatever you want.\nFull Font Awesome Free license: https://fontawesome.com/license/free.\n\n# Icons: CC BY 4.0 License (https://creativecommons.org/licenses/by/4.0/)\nIn the Font Awesome Free download, the CC BY 4.0 license applies to all icons\npackaged as SVG and JS file types.\n\n# Fonts: SIL OFL 1.1 License (https://scripts.sil.org/OFL)\nIn the Font Awesome Free download, the SIL OFL license applies to all icons\npackaged as web and desktop font files.\n\n# Code: MIT License (https://opensource.org/licenses/MIT)\nIn the Font Awesome Free download, the MIT license applies to all non-font and\nnon-icon files.\n\n# Attribution\nAttribution is required by MIT, SIL OFL, and CC BY licenses. Downloaded Font\nAwesome Free files already contain embedded comments with sufficient\nattribution, so you shouldn't need to do anything additional when using these\nfiles normally.\n\nWe've kept attribution comments terse, so we ask that you do not actively work\nto remove them from files, especially code. They're a great way for folks to\nlearn about Font Awesome.\n\n# Brand Icons\nAll brand icons are trademarks of their respective owners. The use of these\ntrademarks does not indicate endorsement of the trademark holder by Font\nAwesome, nor vice versa. **Please do not use brand logos for any purpose except\nto represent the company, product, or service to which they refer.**","Permission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.","Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   Copyright 2011 Mike Samuel et al\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.","This software consists of voluntary contributions made by many\nindividuals. For exact contribution history, see the revision history\navailable at https://github.com/jquery/jquery-ui\n\nThe following license applies to all parts of this software except as\ndocumented below:\n\n====\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n====\n\nCopyright and related rights for sample code are waived via CC0. Sample\ncode is defined as all source code contained within the demos directory.\n\nCC0: http://creativecommons.org/publicdomain/zero/1.0/\n\n====\n\nAll files located in the node_modules and external directories are\nexternally maintained libraries used by this software which have their\nown licenses; we recommend you read them, as their terms may differ from\nthe terms above.","<!-- IGNORE THE HTML BLOCK BELOW, THE INTERESTING PART IS AFTER IT -->\n\n<h1 align=\"center\">Popper.js</h1>\n\n<p align=\"center\">\n    <strong>A library used to position poppers in web applications.</strong>\n</p>\n\n<p align=\"center\">\n    <img src=\"http://badge-size.now.sh/https://unpkg.com/popper.js/dist/popper.min.js?compression=brotli\" alt=\"Stable Release Size\"/>\n  <img src=\"http://badge-size.now.sh/https://unpkg.com/popper.js/dist/popper.min.js?compression=gzip\" alt=\"Stable Release Size\"/>\n    <a href=\"https://codeclimate.com/github/FezVrasta/popper.js/coverage\"><img src=\"https://codeclimate.com/github/FezVrasta/popper.js/badges/coverage.svg\" alt=\"Istanbul Code Coverage\"/></a>\n    <a href=\"https://www.npmjs.com/browse/depended/popper.js\"><img src=\"https://badgen.net/npm/dependents/popper.js\" alt=\"Dependents packages\" /></a>\n    <a href=\"https://spectrum.chat/popper-js\" target=\"_blank\"><img src=\"https://img.shields.io/badge/chat-on_spectrum-6833F9.svg?logo=data%3Aimage%2Fsvg%2Bxml%3Bbase64%2CPHN2ZyBpZD0iTGl2ZWxsb18xIiBkYXRhLW5hbWU9IkxpdmVsbG8gMSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIiB2aWV3Qm94PSIwIDAgMTAgOCI%2BPGRlZnM%2BPHN0eWxlPi5jbHMtMXtmaWxsOiNmZmY7fTwvc3R5bGU%2BPC9kZWZzPjx0aXRsZT5zcGVjdHJ1bTwvdGl0bGU%2BPHBhdGggY2xhc3M9ImNscy0xIiBkPSJNNSwwQy40MiwwLDAsLjYzLDAsMy4zNGMwLDEuODQuMTksMi43MiwxLjc0LDMuMWgwVjcuNThhLjQ0LjQ0LDAsMCwwLC42OC4zNUw0LjM1LDYuNjlINWM0LjU4LDAsNS0uNjMsNS0zLjM1UzkuNTgsMCw1LDBaTTIuODMsNC4xOGEuNjMuNjMsMCwxLDEsLjY1LS42M0EuNjQuNjQsMCwwLDEsMi44Myw0LjE4Wk01LDQuMThhLjYzLjYzLDAsMSwxLC42NS0uNjNBLjY0LjY0LDAsMCwxLDUsNC4xOFptMi4xNywwYS42My42MywwLDEsMSwuNjUtLjYzQS42NC42NCwwLDAsMSw3LjE3LDQuMThaIi8%2BPC9zdmc%2B\" alt=\"Get support or discuss\"/></a>\n    <br />\n    <a href=\"https://travis-ci.org/FezVrasta/popper.js/branches\" target=\"_blank\"><img src=\"https://travis-ci.org/FezVrasta/popper.js.svg?branch=master\" alt=\"Build Status\"/></a>\n    <a href=\"https://saucelabs.com/u/popperjs\" target=\"_blank\"><img src=\"https://badges.herokuapp.com/browsers?labels=none&googlechrome=latest&firefox=latest&microsoftedge=latest&iexplore=11,10&safari=latest\" alt=\"SauceLabs Reports\"/></a>\n</p>\n\n<img src=\"https://raw.githubusercontent.com/FezVrasta/popper.js/master/popperjs.png\" align=\"right\" width=250 />\n\n<!-- 🚨 HEY! HERE BEGINS THE INTERESTING STUFF 🚨 -->\n\n## Wut? Poppers?\n\nA popper is an element on the screen which \"pops out\" from the natural flow of your application.  \nCommon examples of poppers are tooltips, popovers and drop-downs.\n\n\n## So, yet another tooltip library?\n\nWell, basically, **no**.  \nPopper.js is a **positioning engine**, its purpose is to calculate the position of an element\nto make it possible to position it near a given reference element.  \n\nThe engine is completely modular and most of its features are implemented as **modifiers**\n(similar to middlewares or plugins).  \nThe whole code base is written in ES2015 and its features are automatically tested on real browsers thanks to [SauceLabs](https://saucelabs.com/) and [TravisCI](https://travis-ci.org/).\n\nPopper.js has zero dependencies. No jQuery, no LoDash, nothing.  \nIt's used by big companies like [Twitter in Bootstrap v4](https://getbootstrap.com/), [Microsoft in WebClipper](https://github.com/OneNoteDev/WebClipper) and [Atlassian in AtlasKit](https://aui-cdn.atlassian.com/atlaskit/registry/).\n\n### Popper.js\n\nThis is the engine, the library that computes and, optionally, applies the styles to\nthe poppers.\n\nSome of the key points are:\n\n- Position elements keeping them in their original DOM context (doesn't mess with your DOM!);\n- Allows to export the computed informations to integrate with React and other view libraries;\n- Supports Shadow DOM elements;\n- Completely customizable thanks to the modifiers based structure;\n\nVisit our [project page](https://fezvrasta.github.io/popper.js) to see a lot of examples of what you can do with Popper.js!\n\nFind [the documentation here](/docs/_includes/popper-documentation.md).\n\n\n### Tooltip.js\n\nSince lots of users just need a simple way to integrate powerful tooltips in their projects,\nwe created **Tooltip.js**.  \nIt's a small library that makes it easy to automatically create tooltips using as engine Popper.js.  \nIts API is almost identical to the famous tooltip system of Bootstrap, in this way it will be\neasy to integrate it in your projects.  \nThe tooltips generated by Tooltip.js are accessible thanks to the `aria` tags.\n\nFind [the documentation here](/docs/_includes/tooltip-documentation.md).\n\n\n## Installation\nPopper.js is available on the following package managers and CDNs:\n\n| Source |                                                                                  |\n|:-------|:---------------------------------------------------------------------------------|\n| npm    | `npm install popper.js --save`                                                   |\n| yarn   | `yarn add popper.js`                                                             |\n| NuGet  | `PM> Install-Package popper.js`                                                  |\n| Bower  | `bower install popper.js --save`                     |\n| unpkg  | [`https://unpkg.com/popper.js`](https://unpkg.com/popper.js)                     |\n| cdnjs  | [`https://cdnjs.com/libraries/popper.js`](https://cdnjs.com/libraries/popper.js) |\n\nTooltip.js as well:\n\n| Source |                                                                                  |\n|:-------|:---------------------------------------------------------------------------------|\n| npm    | `npm install tooltip.js --save`                                                  |\n| yarn   | `yarn add tooltip.js`                                                            |\n| Bower* | `bower install tooltip.js=https://unpkg.com/tooltip.js --save`                   |\n| unpkg  | [`https://unpkg.com/tooltip.js`](https://unpkg.com/tooltip.js)                   |\n| cdnjs  | [`https://cdnjs.com/libraries/popper.js`](https://cdnjs.com/libraries/popper.js) |\n\n\\*: Bower isn't officially supported, it can be used to install Tooltip.js only trough the unpkg.com CDN. This method has the limitation of not being able to define a specific version of the library. Bower and Popper.js suggests to use npm or Yarn for your projects.  \nFor more info, [read the related issue](https://github.com/FezVrasta/popper.js/issues/390).\n\n### Dist targets\n\nPopper.js is currently shipped with 3 targets in mind: UMD, ESM and ESNext.\n\n- UMD - Universal Module Definition: AMD, RequireJS and globals;\n- ESM - ES Modules: For webpack/Rollup or browser supporting the spec;\n- ESNext: Available in `dist/`, can be used with webpack and `babel-preset-env`;\n\nMake sure to use the right one for your needs. If you want to import it with a `<script>` tag, use UMD.\n\n## Usage\n\nGiven an existing popper DOM node, ask Popper.js to position it near its button\n\n```js\nvar reference = document.querySelector('.my-button');\nvar popper = document.querySelector('.my-popper');\nvar anotherPopper = new Popper(\n    reference,\n    popper,\n    {\n        // popper options here\n    }\n);\n```\n\n### Callbacks\n\nPopper.js supports two kinds of callbacks, the `onCreate` callback is called after\nthe popper has been initialized. The `onUpdate` one is called on any subsequent update.\n\n```js\nconst reference = document.querySelector('.my-button');\nconst popper = document.querySelector('.my-popper');\nnew Popper(reference, popper, {\n    onCreate: (data) => {\n        // data is an object containing all the informations computed\n        // by Popper.js and used to style the popper and its arrow\n        // The complete description is available in Popper.js documentation\n    },\n    onUpdate: (data) => {\n        // same as `onCreate` but called on subsequent updates\n    }\n});\n```\n\n### Writing your own modifiers\n\nPopper.js is based on a \"plugin-like\" architecture, most of its features are fully encapsulated \"modifiers\".  \nA modifier is a function that is called each time Popper.js needs to compute the position of the popper. For this reason, modifiers should be very performant to avoid bottlenecks.  \n\nTo learn how to create a modifier, [read the modifiers documentation](docs/_includes/popper-documentation.md#modifiers--object)\n\n\n### React, Vue.js, Angular, AngularJS, Ember.js (etc...) integration\n\nIntegrating 3rd party libraries in React or other libraries can be a pain because\nthey usually alter the DOM and drive the libraries crazy.  \nPopper.js limits all its DOM modifications inside the `applyStyle` modifier,\nyou can simply disable it and manually apply the popper coordinates using\nyour library of choice.  \n\nFor a comprehensive list of libraries that let you use Popper.js into existing\nframeworks, visit the [MENTIONS](/MENTIONS.md) page.\n\nAlternatively, you may even override your own `applyStyles` with your custom one and\nintegrate Popper.js by yourself!\n\n```js\nfunction applyReactStyle(data) {\n    // export data in your framework and use its content to apply the style to your popper\n};\n\nconst reference = document.querySelector('.my-button');\nconst popper = document.querySelector('.my-popper');\nnew Popper(reference, popper, {\n    modifiers: {\n        applyStyle: { enabled: false },\n        applyReactStyle: {\n            enabled: true,\n            fn: applyReactStyle,\n            order: 800,\n        },\n    },\n});\n\n```\n\n### Migration from Popper.js v0\n\nSince the API changed, we prepared some migration instructions to make it easy to upgrade to\nPopper.js v1.  \n\nhttps://github.com/FezVrasta/popper.js/issues/62\n\nFeel free to comment inside the issue if you have any questions.\n\n### Performances\n\nPopper.js is very performant. It usually takes 0.5ms to compute a popper's position (on an iMac with 3.5G GHz Intel Core i5).  \nThis means that it will not cause any [jank](https://www.chromium.org/developers/how-tos/trace-event-profiling-tool/anatomy-of-jank), leading to a smooth user experience.\n\n## Notes\n\n### Libraries using Popper.js\n\nThe aim of Popper.js is to provide a stable and powerful positioning engine ready to\nbe used in 3rd party libraries.  \n\nVisit the [MENTIONS](/MENTIONS.md) page for an updated list of projects.\n\n\n### Credits\nI want to thank some friends and projects for the work they did:\n\n- [@AndreaScn](https://github.com/AndreaScn) for his work on the GitHub Page and the manual testing he did during the development;\n- [@vampolo](https://github.com/vampolo) for the original idea and for the name of the library;\n- [Sysdig](https://github.com/Draios) for all the awesome things I learned during these years that made it possible for me to write this library;\n- [Tether.js](http://github.hubspot.com/tether/) for having inspired me in writing a positioning library ready for the real world;\n- [The Contributors](https://github.com/FezVrasta/popper.js/graphs/contributors) for their much appreciated Pull Requests and bug reports;\n- **you** for the star you'll give to this project and for being so awesome to give this project a try 🙂\n\n### Copyright and license\nCode and documentation copyright 2016 **Federico Zivolo**. Code released under the [MIT license](LICENSE.md). Docs released under Creative Commons."]}